Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: །སྒོ་ཐམས་ཅད་དུ་རྣམ་པར་སྤྱོད་པས་སྣང་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། དངོས་པོ་མེད་པ་ལ་གནས་པས། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀུན་གྱི་གཞིར་ཐུག་པར་ཐལ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡེ་ཤེས་སྣང་བའི་སྒོ་དང་ལྡན་པའོ།
en: I am endowed with the gateway of the samādhi called the light of the practice of all gateways , with being established in the absence of existence, with noncomposite miraculous powers, and with the gateway of the knowledge of the perfection of wisdom that has reached the basis of the entire realm of the Dharma.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་སེམས་ཅན་གྱི་སྣོད་ཀྱི་འཇིག་རྟེན་གྱི་རྒྱུད་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཤི་འཕོ་བའི་སྒོ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་སྐྱེ་བའི་སྒོ་ཐམས་ཅད་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐ་དད་པ་ཐམས་ཅད་དང་། སྐྱེ་བའི་སྐྱེ་མཆེད་སྣ་ཚོགས་ཀྱི་འཇིག་རྟེན་གྱི་གནས་རྣམ་པ་ཐ་དད་པ་དག་གི་སེམས་ཅན་ཁ་དོག་དང་། དབྱིབས་དང་། ཆུ་ཞེང་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ། སྐྱེ་བ་ཀུན་ཏུ་འབྲེལ་པ། རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ། སྦྱོར་བ་སྣ་ཚོགས་དང་ལྡན་པ། མོས་པ་སྣ་ཚོགས་ཅན་འདི་ལྟ་སྟེ་ལྷའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ཀླུའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། གནོད་སྦྱིན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། དྲི་ཟའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ལྷ་མ་ཡིན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ནམ་མཁའ་ལྡིང་གི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། མིའམ་ཅིའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། མིའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། མི་མ་ཡིན་པའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པ་དང་། ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་གནས་པ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་མོས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མོས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཐབས་སྣ་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚུལ་དང་སྦྱོར་བ་སྣ་ཚོགས་ཀྱིས་བྱེད་དེ།
en: “Noble one, in that way I benefit beings in the entire array of worlds inhabited by beings, in all the states of existences that beings are in, in all the gateways of the deaths of beings, in all the gateways of the births of beings, in all the different existences, in the various different abodes, and in the worlds that are habitations—beings who have various colors, shapes, heights, and widths and who have entered various kinds of rebirths, have different practices, and have different aspirations, which means those within existence as a deva, those within existence as a nāga, those within existence as a yakṣa, those within existence as a gandharva, those within existence as an asura, those within existence as a garuḍa, those within existence as a kinnara, those within existence as a mahoraga, those within existence as a hell being, those within existence as an animal, those within existence in the world of Yama, those within existence as a human, those within existence as a nonhuman, those who have various false views, those who aspire to the Śrāvakayāna, those who aspire to the Pratyeka­buddhayāna, and those who aspire to the Mahāyāna—benefiting them through various methods and through various introductions to the way of wisdom.

source: འདི་ལྟར་སེམས་ཅན་ལ་ལ་ལ་ནི་བཟོའི་རྒྱུད་ཐ་དད་པ་ཐམས་ཅད་དང་ལྡན་པའི་གཟུགས་སྣང་བས་འཇིག་རྟེན་གྱི་བཟོ་སྣ་ཚོགས་བསླབས་ཤིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “This means that I benefit some beings with the light of the power of mental retention that possesses all the knowledge of the various crafts so that they will learn the various worldly crafts.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་བསྟབས་པའི་ཕྱིར་བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་བསྡུ་བའི་ཐབས་ཀྱིས་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings through the application of the four methods of gathering pupils, which means leading them to omniscient wisdom.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བའི་ཡེ་ཤེས་ཀྱི་སྒོ་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བརྗོད་ཅིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings by describing the perfections, thus generating the light of the gateway of the wisdom that transforms into omniscience.

source: བྱང་ཆུབ་ཀྱི་ས་བོན་ཆུད་མི་ཟ་བར་བརྟན་ཅིང་ཡོངས་སུ་བསྐྱེད་པས།
en: “I benefit some beings by describing the aspiration to enlightenment, thus developing an imperishable, strengthened seed of enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཡོངས་སུ་བརྗོད་ཅིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པ་ཐམས་ཅད་དུ་ཡང་དག་པར་བརྗོད་པས་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings by describing all the aspects of bodhisattva conduct, thus generating the aspiration to purify all buddha realms and ripen all beings.

source: ངན་དུ་སྤྱོད་པའི་རྣམ་པར་སྨིན་པ་དང་། མཐུན་པའི་རྒྱུས་སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བར་འགྱུར་བ་ཡོངས་སུ་བསྟན་པས།
en: “I benefit some beings by causing dismay, by teaching the sufferings experienced by beings in the hells caused by the ripening of their bad conduct.

source: སྐྱོ་བ་ཡོངས་སུ་བསྐྱེད་ཅིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་བསྐྱེད་པའི་ཡོན་ཏན་ཐམས་ཅད་ནི་གདོན་མི་ཟ་བར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་འབྲས་བུའི་མཐར་ཐུག་པར་འགྱུར་བར་བརྗོད་པས།
en: “I benefit some beings by causing delight, by describing all the qualities that arise in the tathāgatas, which are the ultimate result of definite omniscience.

source: དགའ་བ་ཆེན་པོ་བསྐྱེད་ཅིང་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་སྐུ་ལ་མངོན་པར་མོས་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ལམ་འདེབས་པར་བྱ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་དང་། བསྔགས་པ་ཡང་དག་པར་བརྗོད་པས་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings by speaking praises of the qualities of all the tathāgatas, thus generating the aspiration to omniscience and the longing for the qualities and body of a buddha.

source: མི་ཟློགས་ཤིང་ལྷུན་གྱིས་གྲུབ་པ་དང་། རྒྱུན་ཆད་པ་མེད་པར་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ནན་ཏན་དུ་མཛད་པའི་མཐུ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་འཐོབ་པར་མོས་པ་བསྐྱེད་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བ་བརྗོད་པས་དོན་བྱེད་དོ། །སེམས་ཅན་ལ་ལ་ནི་འདི་ལྟ་སྟེ།
en: “I benefit some beings by describing the greatness of the buddhas, thus generating the longing to attain the body of a buddha that possesses the power to undertake continuous, irresistible buddha activity.

source: ཚུར་ཟིལ་གྱིས་གནོན་ལ་ཕར་ཟིལ་གྱིས་མི་གནོན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པར་མོས་པ་བསྐྱེད་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་མངའ་ཆེན་པོ་ཡོངས་སུ་བརྗོད་ཅིང་དོན་བྱེད་དོ།
en: “I benefit some beings by describing the dominance of the buddhas, thus generating the aspiration to attain the perfect body of a buddha, which cannot be surpassed but surpasses all others.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་བོ་ནི་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་འདིའི་བཞི་མདོའི་ཕོངས་ཐམས་ཅད་དང་། སྲང་ཐམས་ཅད་དང་། ལམ་གྱི་སུམ་མདོ་ཐམས་ཅད་དང་། གྲོང་མཚམས་ཐམས་ཅད་དང་། ཁྱིམ་ཐམས་ཅད་དང་། མཐུན་པར་འདུས་པའི་རྡལ་ཐམས་ཅད་དང་གྲོང་ཐམས་ཅད་དང་། གྲོང་གི་རྒྱུད་ཐམས་ཅད་དུ་རྣམ་པ་ཇི་ལྟར་ཚོགས་ཤིང་འདུས་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་ཁྱེའུ་དང་བུ་མོ་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་དང་། སྦྱོར་བ་ཇི་ལྟ་བ་དང་། མཐུ་ཇི་ལྟ་བ་དང་། རྣམ་པར་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་དག་དང་། མཐུན་པའི་ལུས་ཀྱི་ཆུ་ཞེང་དང་དབྱིབས་མངོན་པར་བསྒྲུབས་ཤིང་། ཆོས་སྟོན་ཀྱང་།
en: “Moreover, noble one, I manifest a body of the size and shape that accords with the aspirations, activities, powers, and conducts of all the men, women, boys, and girls who are gathered in all the crossroads, streets, junctions, side streets, houses, trades, districts, and dwellings in the districts of this town of Tosala, and I teach them the Dharma.

source: སེམས་ཅན་དེ་དག་གིས་དེ་སུས་བསྟན་པ་དང་། དེ་ག་ལས་འོངས་པ་མི་ཤེས་ཏེ། གཞན་དུ་ན་ཐོས་ནས་མ་ནོར་བར་ནན་ཏན་དུ་བྱེད་པ་ནི་མེད་པའང་མ་ཡིན་ནོ།
en: Those beings do not know who has taught them or where he has come from, but otherwise having heard me, they all practice correctly.

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ན། ཞགས་པ་འཐུབ་པ་ལྟ་བ་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པ། དགུ་བཅུ་རྩ་དྲུག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་དུ་ཡང་སེམས་ཅན་ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་ཆགས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐམས་ཅད་དང་མཐུན་པར་གནས་ཏེ།
en: “Moreover, noble one, I go everywhere in this Jambudvīpa in order to ripen those who are attached to the ninety-six varieties of heretical views.

source: རིགས་ཀྱི་བུ་ཅི་ལྟར་ཁོ་བོ་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་འདི་ན་སེམས་ཅན་གྱི་དོན་བྱེད་ཅིང་འདུག་པ་དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་གི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་དང་། ཁམས་དང་། རྒྱལ་པོའི་ཕོང་བྲང་འཁོར་ཐམས་ཅད་ན་ཡང་སེམས་ཅན་གྱི་དོན་བྱེད་དོ།
en: “Noble one, in the same way that I benefit beings in this town of Tosala, I benefit beings in all the villages, markets, towns, lands, kingdoms, and capitals in Jambudvīpa.

source: །འཛམ་བུའི་གླིང་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་སྟོང་དང་སྟོང་གཉིས་པ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སེམས་ཅན་གྱི་རྟེན་དུ་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་གནས་སུ་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་གཞིར་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཁམས་སུ་བྱ་བའི་མིང་དུ་གཏོགས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་ཡོངས་སུ་རྒྱུ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་ཡོངས་སུ་འདུ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་རྒྱ་མཚོ་ན་གནས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་རྒྱུད་གནས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཕྱོགས་སུ་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་ཕྱོགས་མཚམས་སུ་བྱ་བ་ཐམས་ཅད་དང་། སེམས་ཅན་སྤྱོད་པའི་གནས་ཐམས་ཅད་དུ་འང་།
en: In the same way that I benefit beings in Jambudvīpa, I do so in the entire four-continent world realm, and in a thousand such world realms, and in a million, and in the great world realms of a billion such world realms. In the same way, I benefit beings according to their aspirations in all the world realms in the ten directions, in all the habitations of beings, in all the dwellings of beings, in all the locations of beings, in all that are known as the abodes of beings, in all the residences of beings, in all the congregations of beings, in all the oceans of beings, in all the lineages of beings, in all the directions of beings, in all the intermediate directions of beings, and in all the conducts of beings.

source: ཐབས་སྣ་ཚོགས་དང་། ཚུལ་སྣ་ཚོགས་དང་། སྒོ་སྣ་ཚོགས་དང་། རིགས་པ་སྣ་ཚོགས་དང་། འཕྲད་པ་སྣ་ཚོགས་དང་། ཐབས་ཀྱི་ཚུལ་སྣ་ཚོགས་དང་། བྱ་བ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: I benefit beings through various methods, various ways, various gateways, various kinds of logic, various connections, various ways of methods, and various actions.

source: །གཟུགས་དང་ཁ་དོག་སྣ་ཚོགས་ཡོངས་སུ་བསྟན་ཅིང་མོས་པར་བྱ་བ་དང་། ཚིག་གི་ལམ་སྣ་ཚོགས་བརྗོད་པས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: I benefit beings through the manifestation of various attractive physical forms and colors. I benefit beings through speaking in various languages.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, in that way, I know this bodhisattva conduct that is all-pervasive and omnipresent, but how could I know the conduct or describe the qualities of those bodhisattvas who possess bodies that are the same as those of all beings;

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་དང་། མཉམ་པའི་ལུས་དང་ལྡན་པ་བདག་དང་། སེམས་ཅན་གྱི་ལུས་སུ་ཐ་མི་དད་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: who have attained the samādhi called identical to the bodies of all beings

source: འཕྲུལ་བའི་འཁོར་ལོ་རྒྱ་ཆེན་པོས་སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་ཁྱབ་པ།
en: who pervade all the classes of existence with a vast wheel of emanations;

source: འཇིག་རྟེན་གྱི་སྐྱེ་བ་ཐམས་ཅད་རང་གི་ལུས་ལ་རྗེས་སུ་སྤྱོད་པ།
en: who perform in their own bodies all worldly births;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱིས་ལྟ་ན་དགའ་ཞིང་ཡིད་དུ་འོང་བའི་སྤྲུལ་པའི་འཁོར་ལོ་ལ་བརྩོན་པ།
en: who are dedicated to the wheel of beautiful emanations that all beings delight to see;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་རིགས་དང་རྒྱུད་དང་ཚེར་སྐྱེ་བ་རབ་ཏུ་སྟོན་པ།
en: who manifest births in the families, clans, and lives of all beings;

source: བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པ་ལ་ཐོགས་པ་མེད་པའི་སྨོན་ལམ་གྱི་འཁོར་ལོ་དང་ལྡན་པ།
en: who possess the unimpeded wheel of aspiration to dwell in all kalpas;

source: མིག་འཕྲུལ་ལྟ་བུའི་སྤྱོད་པ་རྣམ་པར་ཕྱེ་བའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: who have attained the radiance of the display of conduct that is like an illusion;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་བྱེད་ཀྱང་། གོས་པ་མེད་པར་གནས་པ་ལ་བརྩོན་པ།
en: who are dedicated to benefiting all beings and yet remain stainless;

source: དུས་གསུམ་གྱི་འགྲོ་བའི་དབྱིངས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པ།
en: who have realized the equality of all the realms of beings in the three times;

source: ཡེ་ཤེས་ཀྱི་དབྱིངས་བདག་མེད་པ་དང་ལྡན་པས། སྣང་བར་བྱས་པའི་སྙིང་རྗེ་ཆེན་པོ་མཐའ་ཡས་པའི་སྙིང་པོ་དང་ལྡན་པ།
en: who possess the essence of infinite compassion illuminated by the realm of the wisdom of selflessness;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པ་ལ་མངོན་པར་བརྩོན་པ།
en: and who are dedicated to generating the roots of merit of all beings?

source: དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་ཁམས་ཆེན་པོ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུཏ་པ་ལ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in a land called Pṛthurāṣṭra, there dwells a perfume-seller head merchant by the name of Utpalabhūti.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the parivrājaka Sarvagamin, circumambulated the parivrājaka Sarvagamin a hundred thousand times, keeping him to his right, and, looking back again and again, departed from the presence of the parivrājaka Sarvagamin. Utpalabhūti

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལུས་དང་སྲོག་ལ་ནི་མི་ལྟ།
en: Sudhana, the head merchant’s son, had no regard for his life or body;

source: སྲིད་པའི་ལོངས་སྤྱོད་དང་ཡོངས་ས་ཟིན་པ་དང་། ཉེ་བར་བླངས་པ་ལ་མངོན་པར་ཆགས་པའི་གནས་ཐམས་ཅད་ལ་ནི་མི་ལྟ་སེམས་ཅན་གྱི་ཡུལ་གྱི་དགའ་བ་ཐམས་ཅད་ལ་ནི་མི་ལྟ།
en: he had no regard for engaging in dedication to obtaining and possessing the pleasures of existence; he had no regard for the objects of perception that beings delight in;

source: གཟུགས་དང་སྒྲ་དང་དྲི་དང་། བྲོ་དང་། རེག་བྱ་ཐམས་ཅད་ལ་ནི་མི་ལྟ།
en: he had no regard for forms, sounds, smells, tastes, and textures;

source: གཡོག་འཁོར་དང་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པ་ཐམས་ཅད་ལ་ནི་མི་ལྟ་སྟེ།
en: he had no concern for enjoying retinues and pleasures;

source: རྒྱལ་སྲིད་དང་དབང་ཕྱུག་གི་དབང་གི་བདེ་བ་ཐམས་ཅད་ལ་ནི་མི་ལྟ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་བླ་ན་མེད་པར་ཡོངས་སུ་དག་པ་མངོན་པར་བསྒྲུབས་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་དང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ལྟ་བ།
en: he had no regard for any of the pleasures of the power of kingship and sovereignty; he was focused on attaining the highest purification of a buddha realm for the pure ripening and guiding of all beings;

source: མཆོད་པ་དང་བསྙེན་བཀུར་བ་དང་། རིམ་གྲོ་བྱ་བས་མི་ངོམས་པས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ལྟ་བ་དང་། རང་བཞིན་མེད་པ་ཡོངས་སུ་ཤེས་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་བལྟ་བ་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དོན་དུ་ནན་ཏན་བྱ་བ་ལས་ཉམ་པ་མེད་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་ལ་བལྟ་བ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡང་དག་པར་གནས་པར་བྱ་བའི་ཕྱིར།
en: he was focused on never being satisfied with the extent of his offering to, honoring, and serving all the tathāgatas; he was focused on all phenomena with the wisdom that knows their nature; he was focused on the qualities of bodhisattvas so that there would be no decline in his practice, which had the entire ocean of those qualities as its goal;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཆེན་པོ་ལ་ལྟ་བ།
en: he was focused on the great prayers of all bodhisattvas so as to maintain bodhisattva conduct throughout all kalpas;

source: དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཐམས་ཅད་དུའཇུག་པར་བྱ་བ་ལ་ལྟ་བ།
en: he was focused on entering the ocean of the circles of the followers of all tathāgatas;

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་རེ་རེར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྲངས་མེད་པ་ཐམས་ཅད་གཟུང་བ་ལ་རྣམ་པར་འཕྲུལ་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ལ་ལྟ་བ།
en: he was focused on all gateways of bodhisattva samādhis so as to manifest the attainment of all countless bodhisattva samādhis through each samādhi gateway;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་བཟུང་བས་མི་ངོམས་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱི་ཡེ་ཤེས་སྣང་བའི་འཁོར་ལོ་ཐམས་ཅད་ལ་ལྟ་བ།
en: he was focused on all the light of wisdom of all Dharma wheels so as to never be satisfied with the extent of his obtaining Dharma wheels from all the tathāgatas;

source: དེ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་འདི་དག་དང་། གཞན་དག་ཀྱང་དགེ་བའི་བཤེས་གཉེན་ལས་འབྱུང་བ་སྟེ།
en: and he was focused on the kalyāṇamitras, who are the source of qualities, because the kalyāṇamitras are the source of the qualities of the buddhas, the bodhisattvas, and others.

source: དགེ་བའི་བཤེས་གཉེན་ནི་དེ་དག་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་གྱུར་པ་མ་ཡིན་པར་ཡང་དག་པར་ལྟ་ཞིང་མཐར་གྱིས་ཡུལ་ཁམས་ཆེན་པོ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Sudhana eventually arrived at the land called Pṛthurāṣṭra.

source: སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས་མཐོང་ནས།
en: He looked and searched for the perfume-seller head merchant by the name of Utpalabhūti.

source: སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: He saw the perfume-seller head merchant Utpalabhūti and approached him.

source: དྲུང་དུ་སོང་ནས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལའི་མདུན་དུ་འདུག་ཏེ།
en: After approaching him, Sudhana bowed his head to the perfume-seller head merchant Utpalabhūti’s feet, circumambulated the perfume-seller head merchant Utpalabhūti many hundreds of thousands of times, and sat down before the perfume-seller head merchant Utpalabhūti.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པའི་ཡེ་ཤེས་འཚལ་ཏེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་ཡང་དགའ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པར་བགྱི་བར་ཡང་དགའ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་སྐུ་ཡོངས་སུ་འཚལ་བར་བགྱི་བར་ཡང་དགའ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བགྱི་བར་ཡང་དགའ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་སྣང་བར་བགྱིད་པར་ཡང་དགའ།
en: With his hands placed together in homage, he said, “Ārya, I seek the wisdom that is the same as that of all the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་བརྟེན་པར་ཡང་དགའ། སྒྲིབ་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་གཏོར་བར་ཡང་དགའ། ཞིང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་རྣམ་པར་རྒྱུ་བར་ཡང་འཚལ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་བར་མ་འཚལ་ཏོ།
en: I rejoice in the fulfillment of the field of prayers made in the past by all the buddhas, I rejoice in the accomplishment of the Dharma body of all the buddhas, I seek the wisdom body of all the buddhas, I rejoice in the purification of all the fields of bodhisattva conduct, I rejoice in the light of all the fields of bodhisattva samādhis, I rejoice in the stability of all the fields of the bodhisattva power of mental retention, I rejoice in the dispelling of the entire field of kleśas, I seek to travel in all the fields of the realms, and I have set out upon the highest complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and how they should practice it, and how through having practiced in that way all bodhisattvas become omniscient.”

source: །སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: Utpalabhūti said to him, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སྤོས་ཐམས་ཅད་ཤེས་ཏེ།
en: “Noble one, I know all perfumes.

source: སྤོས་སྦྱར་བ་ཐམས་ཅད་དང་། བདུག་སྤོས་ཐམས་ཅད་དང་། བདུག་སྤོས་སྦྱར་བ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། བྱུག་པ་སྦྱར་བ་ཐམས་ཅད་དང་། ཕྱེ་མ་ཐམས་ཅད་དང་། ཕྱེ་མ་སྦྱར་བ་ཐམས་ཅད་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མའི་རྣམ་པ་ཐམས་ཅད་ཀྱང་ཤེས་ཏེ།
en: I know about all combined perfumes, all incenses, all combinations of perfumes and incenses, all ointments, all combined ointments, all powders, all combinations of powders, and all perfumes, ointments, and powders.

source: ལྷའི་སྤོས་ཀྱང་ཤེས་སོ།
en: I know the perfumes of the devas.

source: །ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་སྤོས་ཀྱང་ཤེས་སོ།
en: I also know the perfumes of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans.

source: །ནད་གསོ་བའི་སྤོས་དང་། ཡིད་མི་བདེ་བ་བསྩལ་བའི་སྤོས་དང་། འཇིག་རྟེན་གྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པའི་སྤོས་དང་། ཉོན་མོངས་པ་འབར་བར་བྱ་བའི་སྤོས་དང་། ཉོན་མོངས་པ་ཞི་བར་བ་བའི་སྤོས་དང་། འདུས་བྱས་ཀྱི་དགའ་བ་དང་། བདེ་བ་སྣ་ཚོགས་ཡོངས་སུ་བསྐྱེད་པའི་སྤོས་དང་། འདུས་བྱས་ཐམས་ཅད་ལས་སྐྱོ་བ་ཡོངས་སུ་བསྐྱེད་པའི་སྤོས་དང་། བག་བྱ་བའི་གནས་ཐམས་ཅད་སེལ་བའི་སྤོས་དང་། སངས་རྒྱས་ཡིད་ལ་བྱ་བའི་རྒྱུད་ཡང་དག་པར་འབྱུང་བའི་སྤོས་དང་། ཆོས་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྤོས་དང་། འཕགས་པས་སྤྱད་པའི་སྤོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤོས་རྣམ་པ་ཐ་དད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་རྣམ་པར་དགོད་པའི་སྤོས་ཀྱང་ཤེས་ཏེ།
en: “I know the perfumes that heal sickness. I also know the perfumes that dispel unhappiness, the perfumes that give rise to worldly happiness, the perfumes that cause the kleśas to blaze, the perfumes that cause kleśas to cease, the perfumes that create various kinds of composite happiness and bliss, the perfumes that create composite sadness, the perfumes that dispel all intoxication and carelessness, the perfumes that accomplish a continuous focus on the buddhas, the perfumes of understanding the way of the Dharma, the perfumes of ārya conduct, the various bodhisattva perfumes, and the perfumes of being established on all the bodhisattva levels.

source: །ཁོ་བོས་སྤོསདེ་དག་ཐམས་ཅད་རྣམ་པ་ཇི་ལྟ་བུའང་རབ་ཏུ་ཤེས་སོ།
en: I know the aspects of all those perfumes.

source: །འབྱུང་བ་དང་། སྐྱེ་བ་དང་། འགྲུབ་པ་དང་། ཡོངས་སུ་རྫོགས་པ་དང་། ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་སྤང་བ་དང་། རབ་ཏུ་སྦྱར་བ་དང་། ཡོངས་སུ་སྤྱད་པ་དང་། ཡུལ་དང་མཐུ་དང་ལས་དང་རྒྱུ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I also know their origin, creation, accomplishment, perfection, purification, elimination, combination, usage, object, power, action, and cause.

source: །རིགས་ཀྱི་བུ་མིའི་འཇིག་རྟེན་ན་སྤོས་གླང་པོའི་སྙིང་པོ་ཞེས་བྱ་བ། ཀླུ་ཡོངས་སུ་འཁྲུག་པར་བྱེད་པ་ཡོད་དེ། དེའི་རི་ལུ་ཏིལ་གྱི་འབྲུ་ཙམ་གྱིས་ཀྱང་ཡུལ་ཁམས་ཆེན་པོ་ཐམས་ཅད་སྤོས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་ཤིན་ཏུ་སྟུག་པས་ཀུན་ནས་ཁེབས་པར་གྱུར་ཏེ།
en: “Noble one, in the world there is the perfume called elephant essence that disconcerts the nāgas. A pellet merely the size of a sesame seed will pervade the entire land of Pṛthurāṣṭra with a thick net of a cloud of perfume.

source: ཞག་བདུན་དུ་སྤོས་ཆུའི་རྒྱུན་ཤིན་ཏུ་ཕྲ་བའི་ཆར་མངོན་པར་འབབ་བོ།
en: For seven days there will fall a fine rain of scented water.

source: །དེའི་ཚེ་སེམས་ཅན་སུའི་ལུས་སམ་གོས་ལ་སྤོས་ཆུའི་རྒྱུན་དེ་དག་གིས་བབ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མེ་ཏོག་གསེར་གྱི་ཁ་དོག་དུ་འདུག་པས་རྣམ་པར་བརྒྱན་པའི་གོས་དང་ལུས་སུ་འགྱུར་རོ། །ཁང་པ་དང་གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པ་གང་དུ་བབ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མེ་ཏོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་རྣམ་པར་བརྒྱན་པར་གནས་སོ།
en: At that time, when that scented water falls on any being’s body or clothing, all their bodies and clothing will become adorned with golden flowers.
